#### Data In Motion
# Pandas Weekly Challenge - Week 4
by Vaibhav Shaharwale

LinkedIn : https://www.linkedin.com/in/vaibhav-shaharwale-65460b177/

Challenge Questions

1. See the first 10 entries.
2. Delete the columns 'Unnamed: 0' and 'Id'.
3. Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.
5. How many different names exist in the dataset?
6. What is the name with most occurrences?
7. What is the standard deviation of count of names?
8. Get a summary of the dataset with the mean, min, max, std and quartiles.

In [1]:
import pandas as pd
data_import = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [2]:
baby_name = data_import.copy()
baby_name.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [3]:
baby_name.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [4]:
baby_name.isna().sum()

Unnamed: 0    0
Id            0
Name          0
Year          0
Gender        0
State         0
Count         0
dtype: int64

In [5]:
baby_name.duplicated().sum()

0

# 1. See the first 10 entries.

In [6]:
baby_name.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

# 2. Delete the columns 'Unnamed: 0' and 'Id'.

In [7]:
baby_name.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_name.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

# 3. Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.

In [8]:
names = baby_name.groupby(['Name']).Count.sum().reset_index().sort_values('Count', ascending=False)
names.head()

           Name   Count
7198      Jacob  242874
5378       Emma  214852
12111   Michael  214405
5579      Ethan  209277
6973   Isabella  204798

# How many different names exist in the dataset?

In [9]:
baby_name.Name.nunique()

17632

# 6. What is the name with most occurrences?

In [10]:
baby_name.Name.value_counts().head()

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

Riley is the name with most occurrences

# 7. What is the standard deviation of count of names?

In [11]:
baby_name.Count.std()

97.39734648625934

# 8. Get a summary of the dataset with the mean, min, max, std and quartiles.

In [12]:
baby_name.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,1016395.0,2009.053190,3.138293,2004.0,2006.0,2009.0,2012.0,2014.0
Count,1016395.0,34.850124,97.397346,5.0,7.0,11.0,26.0,4167.0